{
  "module": "keras.src.models.functional",
  "class_name": "Functional",
  "config": {
    "name": "functional",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [
            null,
            784
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer"
        },
        "registered_name": null,
        "name": "input_layer",
        "inbound_nodes": []
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            784
          ]
        },
        "name": "dense",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    784
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "input_layer",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_2",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_1",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "res1_add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              1024
            ],
            [
              null,
              1024
            ]
          ]
        },
        "name": "res1_add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_2",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "activation": "relu"
        },
        "registered_name": null,
        "name": "activation",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "res1_add",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_3",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "activation",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_4",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_3",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "res2_add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              1024
            ],
            [
              null,
              1024
            ]
          ]
        },
        "name": "res2_add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "activation",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_4",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "activation": "relu"
        },
        "registered_name": null,
        "name": "activation_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "res2_add",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_5",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_5",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "activation_1",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_6",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_6",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_5",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "res3_add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              1024
            ],
            [
              null,
              1024
            ]
          ]
        },
        "name": "res3_add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "activation_1",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_6",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "activation": "relu"
        },
        "registered_name": null,
        "name": "activation_2",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "res3_add",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_7",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_7",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "activation_2",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_8",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_8",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_7",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "res4_add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              1024
            ],
            [
              null,
              1024
            ]
          ]
        },
        "name": "res4_add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "activation_2",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_8",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "activation": "relu"
        },
        "registered_name": null,
        "name": "activation_3",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "res4_add",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_9",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_9",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "activation_3",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_10",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_10",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_9",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "res5_add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              1024
            ],
            [
              null,
              1024
            ]
          ]
        },
        "name": "res5_add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "activation_3",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_10",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_4",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "activation": "relu"
        },
        "registered_name": null,
        "name": "activation_4",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "res5_add",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_11",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_11",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "activation_4",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_12",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_12",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_11",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "res6_add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              1024
            ],
            [
              null,
              1024
            ]
          ]
        },
        "name": "res6_add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "activation_4",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_12",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_5",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "activation": "relu"
        },
        "registered_name": null,
        "name": "activation_5",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "res6_add",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_13",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_13",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "activation_5",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_14",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_14",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense_13",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Add",
        "config": {
          "name": "res7_add",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          }
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            [
              null,
              1024
            ],
            [
              null,
              1024
            ]
          ]
        },
        "name": "res7_add",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "activation_5",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      1024
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_14",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_6",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "activation": "relu"
        },
        "registered_name": null,
        "name": "activation_6",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "res7_add",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_15",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1024
          ]
        },
        "name": "dense_15",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "activation_6",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_16",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
              "name": "float32"
            },
            "registered_name": null
          },
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
